---
type: DuctFittingAndAccessoryPressureDropUIData
namespace: Autodesk.Revit.UI.Mechanical
version: 2024
members: 4
tags: [revit-api, class]
---

# DuctFittingAndAccessoryPressureDropUIData

`Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIData` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetUIDataItems | 2014 | `public IList < DuctFittingAndAccessoryPressureDropUIDataItem > GetUIDataItems ()` |
| Method | GetUnits | 2014 | `public Units GetUnits ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |